app/controllers/home_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 1]]
---
  def index
    @categories = Category.where(user_id: current_user.id)

INSERT INTO "categories" ("name", "icon", "Totalamount", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "casa"], ["icon", "https://i.pravatar.cc/50"], ["Totalamount", nil], ["user_id", 4], ["created_at", "2023-10-20 07:03:19.156588"], ["updated_at", "2023-10-20 07:03:19.156588"]]
---
  def create
    @category_data = Category.new(categorynew_params)
    @category_data.user_id = current_user.id

    if @category_data.save