app/controllers/payment_controller.rb

    def show
        @category = Category.find(params[:id])
        @payments = CategoryPayment.where(category_id: params[:id]).includes(:payment).order(created_at: :desc)

        total_amount = 0

        @payments.each do |item|
            total_amount += item.payment.amount
        end

        @category.update(Totalamount: total_amount)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "category_payments".* FROM "category_payments" WHERE "category_payments"."category_id" = $1 ORDER BY "category_payments"."created_at" DESC  [["category_id", 2]]
SELECT "payments".* FROM "payments" WHERE "payments"."id" IN ($1, $2)  [["id", 4], ["id", 3]]
UPDATE "categories" SET "Totalamount" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["Totalamount", "1000.0"], ["updated_at", "2023-10-20 03:01:42.651077"], ["id", 1]]

    def create
        @payment = Payment.new(payment_params)
        @payment.author_id = current_user.id
        @payment.save

        @category_payment = CategoryPayment.new
        @category_payment.category_id = params[:id]
        @category_payment.payment_id = @payment.id
        @category_payment.save
---
INSERT INTO "payments" ("name", "amount", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ropita"], ["amount", "400.0"], ["author_id", 1], ["created_at", "2023-10-20 03:06:44.196850"], ["updated_at", "2023-10-20 03:06:44.196850"]]
INSERT INTO "category_payments" ("category_id", "payment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_id", 3], ["payment_id", 24], ["created_at", "2023-10-20 03:06:44.222401"], ["updated_at", "2023-10-20 03:06:44.222401"]]